jetpax/ESP32-sveltekit/lib/ovms/ovms_boot.cpp
/*
;    Project:       Open Vehicle Monitor System
;    Date:          14th March 2017
;
;    Changes:
;    1.0  Initial release
;
;    (C) 2011       Michael Stegen / Stegen Electronics
;    (C) 2011-2017  Mark Webb-Johnson
;    (C) 2011        Sonny Chen @ EPRO/DX
;
; Permission is hereby granted, free of charge, to any person obtaining a copy
; of this software and associated documentation files (the "Software"), to deal
; in the Software without restriction, including without limitation the rights
; to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
; copies of the Software, and to permit persons to whom the Software is
; furnished to do so, subject to the following conditions:
;
; The above copyright notice and this permission notice shall be included in
; all copies or substantial portions of the Software.
;
; THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
; IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
; FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
; AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
; LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
; OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
; THE SOFTWARE.
*/

#include "ovms_log.h"
static const char *TAG = "boot";

#include "freertos/FreeRTOS.h"
#include "freertos/xtensa_api.h"
#include "rom/rtc.h"
#include "rom/uart.h"
#include "soc/rtc_cntl_reg.h"
#include "global.h"
#include "esp_system.h"
#include "esp_sleep.h"
#include "esp_idf_version.h"
#if ESP_IDF_VERSION_MAJOR < 4
#include "esp_panic.h"
#else
#include "esp_private/panic_internal.h"
#include "esp_private/system_internal.h"
#endif
#include "esp_task_wdt.h"
#include <driver/adc.h>

#include "ovms_boot.h"
#include "ovms_command.h"
#include "ovms_metrics.h"
#include "ovms_config.h"
#include "metrics_standard.h"
#include "string_writer.h"
#include <string.h>

boot_data_t __attribute__((section(".rtc.noload"))) boot_data;

extern void xt_unhandled_exception(XtExcFrame *frame);

// Exception descriptions copied from esp32/panic.c:
static const char *edesc[] = {
    "IllegalInstruction", "Syscall", "InstructionFetchError", "LoadStoreError",
    "Level1Interrupt", "Alloca", "IntegerDivideByZero", "PCValue",
    "Privileged", "LoadStoreAlignment", "res", "res",
    "InstrPDAddrError", "LoadStorePIFDataError", "InstrPIFAddrError", "LoadStorePIFAddrError",
    "InstTLBMiss", "InstTLBMultiHit", "InstFetchPrivilege", "res",
    "InstrFetchProhibited", "res", "res", "res",
    "LoadStoreTLBMiss", "LoadStoreTLBMultihit", "LoadStorePrivilege", "res",
    "LoadProhibited", "StoreProhibited", "res", "res",
    "Cp0Dis", "Cp1Dis", "Cp2Dis", "Cp3Dis",
    "Cp4Dis", "Cp5Dis", "Cp6Dis", "Cp7Dis"
};
#define NUM_EDESCS (sizeof(edesc) / sizeof(char *))

// Register names copied from esp32/panic.c:
static const char *sdesc[] = {
    "PC      ", "PS      ", "A0      ", "A1      ", "A2      ", "A3      ", "A4      ", "A5      ",
    "A6      ", "A7      ", "A8      ", "A9      ", "A10     ", "A11     ", "A12     ", "A13     ",
    "A14     ", "A15     ", "SAR     ", "EXCCAUSE", "EXCVADDR", "LBEG    ", "LEND    ", "LCOUNT  "
};

// Boot reasons [bootreason_t]
static const char* const bootreason_name[] = {
    "PowerOn",
    "Wakeup",
    "SoftReset",
    "FirmwareUpdate",
    "EarlyCrash",
    "Crash",
};
#define NUM_BOOTREASONS (sizeof(bootreason_name) / sizeof(char *))

// Reset reasons [esp_reset_reason_t]
static const char *resetreason_name[] = {
    "Unknown/unset",
    "Power-on event",
    "External pin",
    "esp_restart",
    "Exception/panic",
    "Interrupt watchdog",
    "Task watchdog",
    "Other watchdogs",
    "Exiting deep sleep",
    "Brownout",
    "SDIO",
};
#define NUM_RESETREASONS (sizeof(resetreason_name) / sizeof(char *))


void boot_status(int verbosity, OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv)
  {
  
  time_t rawtime;
  struct tm* tml;
  char tb[32];
  
  writer->printf("Last boot was %" PRId32 " second(s) ago\n",monotonictime);
  
  time(&rawtime);
  rawtime = rawtime-(time_t)monotonictime;
  tml = localtime(&rawtime);
  if ((strftime(tb, sizeof(tb), "%Y-%m-%d %H:%M:%S %Z", tml) > 0) && rawtime > 0)
    writer->printf("Time at boot: %s\n", tb);

  writer->printf("  This is reset #%d since last power cycle\n",boot_data.boot_count);
  writer->printf("  Detected boot reason: %s (%d/%d)\n",Boot::instance(TAG).GetBootReasonName(),boot_data.bootreason_cpu0,boot_data.bootreason_cpu1);
  writer->printf("  Reset reason: %s (%d)\n",Boot::instance(TAG).GetResetReasonName(),Boot::instance(TAG).GetResetReason());
  writer->printf("  Crash counters: %d total, %d early\n",Boot::instance(TAG).GetCrashCount(),Boot::instance(TAG).GetEarlyCrashCount());

  if (Boot::instance(TAG).m_shutdown_timer>0)
    {
    writer->printf("\nShutdown for %s in progress (%d secs, waiting for %d tasks)\n",
      Boot::instance(TAG).m_shutdown_deepsleep ? "DeepSleep" : "Restart",
      Boot::instance(TAG).m_shutdown_timer, Boot::instance(TAG).m_shutdown_pending);
    }

  if (Boot::instance(TAG).GetCrashCount() > 0)
    {
    // output data of last crash:
    writer->printf("\nLast crash: ");
    if (boot_data.crash_data.is_abort)
      {
      // Software controlled panic:
      writer->printf("abort() was called on core %d\n", boot_data.crash_data.core_id);
      if (boot_data.stack_overflow_taskname[0])
        writer->printf("  Stack overflow in task %s\n", boot_data.stack_overflow_taskname);
      else if (boot_data.curr_task[0].name[0] && !boot_data.curr_task[0].stackfree)
        writer->printf("  Pending stack overflow in task %s\n", boot_data.curr_task[0].name);
      else if (boot_data.curr_task[1].name[0] && !boot_data.curr_task[1].stackfree)
        writer->printf("  Pending stack overflow in task %s\n", boot_data.curr_task[1].name);
      }
    else
      {
      // Hardware exception:
      int exccause = boot_data.crash_data.reg[19];
      writer->printf("%s exception on core %d\n",
        (exccause < NUM_EDESCS) ? edesc[exccause] : "Unknown", boot_data.crash_data.core_id);
      writer->printf("  Registers:\n");
      for (int i=0; i<24; i++)
        writer->printf("  %s: 0x%08" PRIx32 "%s", sdesc[i], boot_data.crash_data.reg[i], ((i+1)%4) ? "" : "\n");
      }

    for (int core = 0; core < portNUM_PROCESSORS; core++)
      {
      if (boot_data.curr_task[core].name[0])
        writer->printf("  Current task on core %d: %s, %" PRIu32 " stack bytes free\n",
          core, boot_data.curr_task[core].name, boot_data.curr_task[core].stackfree);
      }

    writer->printf("  Backtrace:\n ");
    for (int i=0; i<OVMS_BT_LEVELS && boot_data.crash_data.bt[i].pc; i++)
      writer->printf(" 0x%08" PRIx32, boot_data.crash_data.bt[i].pc);

    if (boot_data.curr_event_name[0])
      {
      writer->printf("\n  Event: %s@%s %u secs", boot_data.curr_event_name, boot_data.curr_event_handler,
        boot_data.curr_event_runtime);
      }

    if (Boot::instance(TAG).GetResetReason() == ESP_RST_TASK_WDT)
      {
      writer->printf("\n  WDT tasks: %s", boot_data.wdt_tasknames);
      }

    writer->printf("\n  Version: %s\n", MetricsStandard::instance(TAG).ms_m_version->AsString("").c_str());
    writer->printf("\n  Hardware: %s\n", MetricsStandard::instance(TAG).ms_m_hardware->AsString("").c_str());
    }
  }

void boot_clear(int verbosity, OvmsWriter* writer, OvmsCommand* cmd, int argc, const char* const* argv)
  {
  memset(&boot_data,0,sizeof(boot_data_t));
  boot_data.crc = boot_data.calc_crc();
  writer->puts("Boot status data has been cleared.");
  }

#if ESP_IDF_VERSION_MAJOR >= 4
/*
Error handling for OVMS/ESP-IDF4+ is done differently than the OVMS/ESP-IDF3 versions.
- In OVMS/ESP-IDF3, ESP-IDF was patched to add support for a custom error handler.
- In OVMS/ESP-IDF4+, we take advantage of the ability of the linker to wrap a symbol,
  and we thus wrap the original `esp_panic_handler` (panic.c)

See:
- https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/build-system.html#wrappers-to-redefine-or-extend-existing-functions
- https://github.com/espressif/esp-idf/issues/7681#issuecomment-941957783
*/
extern "C" {
  extern void esp_panic_handler_reconfigure_wdts(void);

  /* Declare the real panic handler function. We'll be able to call it after executing our custom code */
  extern void __real_esp_panic_handler(panic_info_t*);

