jetpax/ESP32-sveltekit/lib/ovms/ovms_boot.cpp
  /* This function will be considered the esp_panic_handler to call in case a panic occurs */
  void __wrap_esp_panic_handler(panic_info_t* info)
    {
    /* Custom code, count the number of panics or simply print a message */
    esp_rom_printf("Panic has been triggered by the program!\n");

    /*
    This logic comes from the original esp_panic_handler (in panic.c) which is
    used to set the reset reason hint.
    However, our wrapper happens *before* this function, so cannot benefit from
    the hint.
    */
    esp_reset_reason_t reset_hint = esp_reset_reason_get_hint();
    if (ESP_RST_UNKNOWN == reset_hint)
      {
      switch (info->exception)
        {
        case PANIC_EXCEPTION_IWDT:
            reset_hint = ESP_RST_INT_WDT;
            break;
        case PANIC_EXCEPTION_TWDT:
            reset_hint = ESP_RST_TASK_WDT;
            break;
        case PANIC_EXCEPTION_ABORT:
        case PANIC_EXCEPTION_FAULT:
        default:
            reset_hint = ESP_RST_PANIC;
            break;
        }
      }

    /* Call the ErrorCallback from OVMS/ESP-IDF3 - adding the `reset_hint` parameter */
    Boot::ErrorCallback(info->frame, info->core, g_panic_abort, reset_hint);

    esp_panic_handler_reconfigure_wdts();

    /* Call the original panic handler function to finish processing this error (creating a core dump for example...) */
    __real_esp_panic_handler(info);
    }
}
#endif

// Construct On First Use instantiation 
Boot &Boot::instance(const char* caller) {
    static bool initialized = false;
    if (!initialized) {
      initialized = true;
        ESP_LOGI(TAG, "COFU by %s", caller);
    }
    static Boot _instance;
    return _instance;
}

Boot::Boot()
  {
  RESET_REASON cpu0 = rtc_get_reset_reason(0);
  RESET_REASON cpu1 = rtc_get_reset_reason(1);

  m_shutdown_timer = 0;
  m_shutdown_pending = 0;
  m_shutdown_deepsleep = false;
  m_shutdown_deepsleep_seconds = 0;
  m_shutting_down = false;

  m_resetreason = esp_reset_reason(); // Note: necessary to link reset_reason module

  if (cpu0 == POWERON_RESET)
    {
    memset(&boot_data,0,sizeof(boot_data_t));
    m_bootreason = BR_PowerOn;
    ESP_LOGI(TAG, "Power cycle reset detected");
    }
  else if (cpu0 == DEEPSLEEP_RESET)
    {
    memset(&boot_data,0,sizeof(boot_data_t));
    m_bootreason = BR_Wakeup;
    esp_sleep_wakeup_cause_t wakeup_cause = esp_sleep_get_wakeup_cause();
    ESP_LOGI(TAG, "Wakeup from deep sleep detected, wakeup cause %d", wakeup_cause);

    // There is currently only one deep sleep application: saving the 12V battery
    // from depletion. So we need to check if the voltage level is sufficient for
    // normal operation now. MyPeripherals has not been initialized yet, so we need
    // to read the ADC manually here.
    #ifdef CONFIG_OVMS_COMP_ADC
      // Note: RTC_MODULE nags about a lock release before aquire, this can be ignored
      //  (reason: RTC_MODULE needs FreeRTOS for locking, which hasn't been started yet)
      adc1_config_width(ADC_WIDTH_BIT_12);
      adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_11);
      uint32_t adc_level = 0;
      for (int i = 0; i < 5; i++)
        adc_level += adc1_get_raw(ADC1_CHANNEL_0);
      float level_12v = (float) adc_level / 5 / 195.7;
      ESP_LOGI(TAG, "12V level: ~%.1fV", level_12v);
      if (level_12v > 11.0)
        ESP_LOGI(TAG, "12V level sufficient, proceeding with boot");
      else if (level_12v < 1.0)
        ESP_LOGI(TAG, "Assuming USB powered, proceeding with boot");
      else
        {
        ESP_LOGE(TAG, "12V level insufficient, re-entering deep sleep");
        esp_deep_sleep(1000000LL * 60);
        }
    #else
      ESP_LOGW(TAG, "ADC not available, cannot check 12V level");
    #endif // CONFIG_OVMS_COMP_ADC
    }
  else if (boot_data.crc != boot_data.calc_crc())
    {
    memset(&boot_data,0,sizeof(boot_data_t));
    m_bootreason = BR_PowerOn;
    ESP_LOGW(TAG, "Boot data corruption detected, data cleared");
    }
  else
    {
    boot_data.boot_count++;
    ESP_LOGI(TAG, "Boot #%d reasons for CPU0=%d and CPU1=%d",boot_data.boot_count,cpu0,cpu1);

    if (boot_data.soft_reset)
      {
      boot_data.crash_count_total = 0;
      boot_data.crash_count_early = 0;
      m_bootreason = BR_SoftReset;
      m_resetreason = ESP_RST_SW;
      ESP_LOGI(TAG, "Soft reset by user");
      }
    else if (boot_data.firmware_update)
      {
      boot_data.crash_count_total = 0;
      boot_data.crash_count_early = 0;
      m_bootreason = BR_FirmwareUpdate;
      ESP_LOGI(TAG, "Firmware update reset");
      m_resetreason = ESP_RST_SW;
      }
    else if (!boot_data.stable_reached)
      {
      boot_data.crash_count_total++;
      boot_data.crash_count_early++;
      m_bootreason = BR_EarlyCrash;
      ESP_LOGE(TAG, "Early crash #%d detected", boot_data.crash_count_early);
      m_resetreason = boot_data.reset_hint;
      ESP_LOGI(TAG, "Reset reason %s (%d)", GetResetReasonName(), GetResetReason());
      }
    else
      {
      boot_data.crash_count_total++;
      m_bootreason = BR_Crash;
      ESP_LOGE(TAG, "Crash #%d detected", boot_data.crash_count_total);
      m_resetreason = boot_data.reset_hint;
      ESP_LOGI(TAG, "Reset reason %s (%d)", GetResetReasonName(), GetResetReason());
      }
    }

  m_crash_count_early = boot_data.crash_count_early;
  m_stack_overflow = boot_data.stack_overflow;
  if (!m_stack_overflow)
    boot_data.stack_overflow_taskname[0] = 0;

  boot_data.bootreason_cpu0 = cpu0;
  boot_data.bootreason_cpu1 = cpu1;
  boot_data.reset_hint = ESP_RST_UNKNOWN;

  // reset flags:
  boot_data.soft_reset = false;
  boot_data.firmware_update = false;
  boot_data.stable_reached = false;
  boot_data.stack_overflow = false;

  boot_data.crc = boot_data.calc_crc();

  // install error handler:
#if ESP_IDF_VERSION_MAJOR < 4
  xt_set_error_handler_callback(ErrorCallback);
#endif
 
  // Register our commands
  OvmsCommand* cmd_boot = OvmsCommandApp::instance(TAG).RegisterCommand("boot","BOOT framework",boot_status, "", 0, 0, false);
  cmd_boot->RegisterCommand("status","Show boot system status",boot_status,"", 0, 0, false);
  cmd_boot->RegisterCommand("clear","Clear/reset boot system status",boot_clear,"", 0, 0, false);
  }

void Boot::SetStable()
  {
  boot_data.stable_reached = true;
  boot_data.crash_count_early = 0;
  boot_data.crc = boot_data.calc_crc();
  }

void Boot::SetSoftReset()
  {
  boot_data.soft_reset = true;
  boot_data.crc = boot_data.calc_crc();
  }

void Boot::SetFirmwareUpdate()
  {
  boot_data.soft_reset = false;
  boot_data.firmware_update = true;
  boot_data.crc = boot_data.calc_crc();
  }

const char* Boot::GetBootReasonName()
  {
  return (m_bootreason >= 0 && m_bootreason < NUM_BOOTREASONS)
    ? bootreason_name[m_bootreason]
    : "Unknown boot reason";
  }

const char* Boot::GetResetReasonName()
  {
  if (m_stack_overflow)
    return "Stack overflow";
  return (m_resetreason >= 0 && m_resetreason < NUM_RESETREASONS)
    ? resetreason_name[m_resetreason]
    : "Unknown reset reason";
  }

static void boot_shutdown_done(const char* event, void* data)
  {
  OvmsConfig::instance(TAG).unmount();

  if (Boot::instance(TAG).m_shutdown_deepsleep)
    {
    // For consistency with init, instead of calling MyPeripherals->m_esp32->SetPowerMode(DeepSleep):
    if (Boot::instance(TAG).m_shutdown_deepsleep_waketime)
      {
      // Accomodate for boot time (15 seconds):
      int seconds = Boot::instance(TAG).m_shutdown_deepsleep_waketime - time(0) - 15;
      if (seconds < 0) seconds = 0;
      esp_deep_sleep(1000000LL * seconds);
      }
    else
      {
      esp_deep_sleep(1000000LL * Boot::instance(TAG).m_shutdown_deepsleep_seconds);
      }
    }
  else
    {
    esp_restart();
    }
  }

static void boot_shuttingdown_done(const char* event, void* data)
  {
  if (Boot::instance(TAG).m_shutdown_pending == 0)
    Boot::instance(TAG).m_shutdown_timer = 2;
  }

