jetpax/ESP32-sveltekit/lib/ovms/ovms_boot.cpp
void Boot::Restart(bool hard)
  {
  SetSoftReset();

  if (hard)
    {
    esp_restart();
    return;
    }

  ESP_LOGI(TAG,"Shutting down for %s...", m_shutdown_deepsleep ? "DeepSleep" : "Restart");
  OvmsMutexLock lock(&m_shutdown_mutex);
  m_shutting_down = true;
  m_shutdown_pending = 0;
  m_shutdown_timer = 70; // Give them 70 seconds to shutdown
  OvmsEvents::instance(TAG).SignalEvent("system.shuttingdown", NULL, boot_shuttingdown_done);

  #undef bind  // Kludgy, but works
  using std::placeholders::_1;
  using std::placeholders::_2;
  OvmsEvents::instance(TAG).RegisterEvent(TAG,"ticker.1", std::bind(&Boot::Ticker1, this, _1, _2));
  }

void Boot::DeepSleep(unsigned int seconds /*=60*/)
  {
  m_shutdown_deepsleep = true;
  m_shutdown_deepsleep_seconds = seconds;
  m_shutdown_deepsleep_waketime = 0;
  Restart(false);
  }

void Boot::DeepSleep(time_t waketime)
  {
  m_shutdown_deepsleep = true;
  m_shutdown_deepsleep_seconds = 0;
  m_shutdown_deepsleep_waketime = waketime;
  Restart(false);
  }

void Boot::ShutdownPending(const char* tag)
  {
  OvmsMutexLock lock(&m_shutdown_mutex);
  m_shutdown_pending++;
  ESP_LOGW(TAG, "Shutdown: %s pending, %d total", tag, m_shutdown_pending);
  }

void Boot::ShutdownReady(const char* tag)
  {
  OvmsMutexLock lock(&m_shutdown_mutex);
  m_shutdown_pending--;
  ESP_LOGI(TAG, "Shutdown: %s ready, %d pending", tag, m_shutdown_pending);
  if (m_shutdown_pending == 0)
    m_shutdown_timer = 2;
  }

void Boot::Ticker1(std::string event, void* data)
  {
  if (m_shutdown_timer > 0)
    {
    OvmsMutexLock lock(&m_shutdown_mutex);
    m_shutdown_timer--;
    if (m_shutdown_timer == 1)
      {
      ESP_LOGI(TAG, "%s now", m_shutdown_deepsleep ? "DeepSleep" : "Restart");
      }
    else if (m_shutdown_timer == 0)
      {
      OvmsEvents::instance(TAG).SignalEvent("system.shutdown", NULL, boot_shutdown_done);
      return;
      }
    else if ((m_shutdown_timer % 5)==0)
      ESP_LOGI(TAG, "%s in %d seconds (%d pending)...",
        m_shutdown_deepsleep ? "DeepSleep" : "Restart", m_shutdown_timer, m_shutdown_pending);
    }
  }

bool Boot::IsShuttingDown()
  {
  return m_shutting_down;
  }


/*
 * Direct UART output utils borrowed from esp32/panic.c
 */
static void panicPutChar(char c)
  {
  while (((READ_PERI_REG(UART_STATUS_REG(CONFIG_CONSOLE_UART_NUM)) >> UART_TXFIFO_CNT_S)&UART_TXFIFO_CNT) >= 126) ;
  WRITE_PERI_REG(UART_FIFO_REG(CONFIG_CONSOLE_UART_NUM), c);
  }

static void panicPutStr(const char *c)
  {
  int x = 0;
  while (c[x] != 0)
    {
    panicPutChar(c[x]);
    x++;
    }
  }

/*
 * This function is called by task_wdt_isr function (ISR for when TWDT times out).
 * It can be redefined in user code to handle twdt events.
 * Note: It has the same limitations as the interrupt function.
 *       Do not use ESP_LOGI functions inside.
 */
extern "C" void esp_task_wdt_isr_user_handler(void)
  {
  panicPutStr("\r\n[OVMS] ***TWDT***\r\n");
  // Save TWDT task info:
#if ESP_IDF_VERSION_MAJOR < 4
  esp_task_wdt_get_trigger_tasknames(boot_data.wdt_tasknames, sizeof(boot_data.wdt_tasknames));
#else
  snprintf(boot_data.wdt_tasknames, sizeof(boot_data.wdt_tasknames), "(unavailable)");
  #warning "(TODO) ESP-IDF >= 4 : list of tasks triggering WDT not available."
#endif
  }

/*
 * This function is called if FreeRTOS detects a stack overflow.
 */
extern "C" void vApplicationStackOverflowHook( TaskHandle_t xTask, char *pcTaskName )
  {
  panicPutStr("\r\n[OVMS] ***ERROR*** A stack overflow in task ");
  panicPutStr((char *)pcTaskName);
  panicPutStr(" has been detected.\r\n");
  strlcpy(boot_data.stack_overflow_taskname, (const char*)pcTaskName, sizeof(boot_data.stack_overflow_taskname));
  boot_data.stack_overflow = true;
  abort();
  }

#if ESP_IDF_VERSION_MAJOR < 4
void Boot::ErrorCallback(XtExcFrame *frame, int core_id, bool is_abort)
  {
  boot_data.reset_hint = ovms_reset_reason_get_hint();

#else

void Boot::ErrorCallback(const void *f, int core_id, bool is_abort, esp_reset_reason_t reset_hint)
  {
#if CONFIG_IDF_TARGET_ARCH_XTENSA
  XtExcFrame *frame = (XtExcFrame *) f;
#elif CONFIG_IDF_TARGET_ARCH_RISCV
  RvExcFrame *frame = (RvExcFrame *) f;
#endif

  boot_data.reset_hint = reset_hint;

#endif

  boot_data.crash_data.core_id = core_id;
  boot_data.crash_data.is_abort = is_abort;

  // Save registers:
  for (int i=0; i<__ARCH_NB_REGS; i++)
    {
    boot_data.crash_data.reg[i] = ((uint32_t*)frame)[i + __ARCH_REG_OFFSET_IN_FRAME];
    }

  // Save backtrace:
  uint32_t i = 0;
#if (ESP_IDF_VERSION_MAJOR < 4) || CONFIG_IDF_TARGET_ARCH_XTENSA
  // (see panic.c::doBacktrace() for code template)
  #define _adjusted_pc(pc) (((pc) & 0x80000000) ? (((pc) & 0x3fffffff) | 0x40000000) : (pc))
  uint32_t pc = frame->pc, sp = frame->a1;
  boot_data.crash_data.bt[i++].pc = _adjusted_pc(pc);
  pc = frame->a0;
  while (i < OVMS_BT_LEVELS)
    {
    uint32_t psp = sp;
    if (!esp_stack_ptr_is_sane(sp))
        break;
    sp = *((uint32_t *) (sp - 0x10 + 4));
    boot_data.crash_data.bt[i++].pc = _adjusted_pc(pc - 3);
    pc = *((uint32_t *) (psp - 0x10));
    if (pc < 0x40000000)
        break;
    }
#else
  #warning "Backtrace not available in crash_data on this architecture - please fix ovms_boot.cpp"
#endif
  while (i < OVMS_BT_LEVELS)
    boot_data.crash_data.bt[i++].pc = 0;

  // Save Event debug info:
  if (!OvmsEvents::instance(TAG).m_current_event.empty())
    {
    strlcpy(boot_data.curr_event_name, OvmsEvents::instance(TAG).m_current_event.c_str(), sizeof(boot_data.curr_event_name));
    if (OvmsEvents::instance(TAG).m_current_callback)
      strlcpy(boot_data.curr_event_handler, OvmsEvents::instance(TAG).m_current_callback->m_caller.c_str(), sizeof(boot_data.curr_event_handler));
    else
      strlcpy(boot_data.curr_event_handler, "EventScript", sizeof(boot_data.curr_event_handler));
    boot_data.curr_event_runtime = monotonictime - OvmsEvents::instance(TAG).m_current_started;
    }
  else
    {
    boot_data.curr_event_name[0] = 0;
    boot_data.curr_event_handler[0] = 0;
    boot_data.curr_event_runtime = 0;
    }

  // Save current tasks:
  panicPutStr("\r\n[OVMS] Current tasks: ");
  for (int core=0; core<portNUM_PROCESSORS; core++)
    {
    TaskHandle_t task = xTaskGetCurrentTaskHandleForCPU(core);
    if (task)
      {
      char *name = pcTaskGetTaskName(task);
      uint32_t stackfree = uxTaskGetStackHighWaterMark(task);
      if (core > 0) panicPutChar('|');
      panicPutStr(name);
      strlcpy(boot_data.curr_task[core].name, name, sizeof(boot_data.curr_task[core].name));
      boot_data.curr_task[core].stackfree = stackfree;
      if (!stackfree) boot_data.stack_overflow = true;
      }
    else
      {
      boot_data.curr_task[core].name[0] = 0;
      boot_data.curr_task[core].stackfree = 0;
      }
    }
  panicPutStr("\r\n");

