jetpax/ESP32-sveltekit/lib/ovms/ovms_boot.cpp
  boot_data.crc = boot_data.calc_crc();
  }

void Boot::NotifyDebugCrash()
  {
  if (GetCrashCount() > 0)
    {
    // Send crash data notification:
    // H type "*-OVM-DebugCrash"
    //  ,<firmware_version>
    //  ,<bootcount>,<bootreason_name>,<bootreason_cpu0>,<bootreason_cpu1>
    //  ,<crashcnt>,<earlycrashcnt>,<crashtype>,<crashcore>,<registers>,<backtrace>
    //  ,<resetreason>,<resetreason_name>
    //  ,<curr_event_name>,<curr_event_handler>,<curr_event_runtime>
    //  ,<wdt_tasknames>
    //  ,<hardware_info>
    //  ,<stack_overflow_task>
    //  ,<core0_task>,<core0_stackfree>,<core1_task>,<core1_stackfree>

    StringWriter buf;
    buf.reserve(2048);
    buf.append("*-OVM-DebugCrash,0,2592000,");
    buf.append(mp_encode(MetricsStandard::instance(TAG).ms_m_version->AsString("")));
    buf.printf(",%d,%s,%d,%d,%d,%d"
      , boot_data.boot_count, GetBootReasonName(), boot_data.bootreason_cpu0, boot_data.bootreason_cpu1
      , GetCrashCount(), GetEarlyCrashCount());

    // type, core, registers:
    if (boot_data.crash_data.is_abort)
      {
      buf.printf(",abort(),%d,", boot_data.crash_data.core_id);
      }
    else
      {
      int exccause = boot_data.crash_data.reg[19];
      buf.printf(",%s,%d,",
        (exccause < NUM_EDESCS) ? edesc[exccause] : "Unknown", boot_data.crash_data.core_id);
      for (int i=0; i<24; i++)
        buf.printf("0x%08" PRIx32 " ", boot_data.crash_data.reg[i]);
      }

    // backtrace:
    buf.append(",");
    for (int i=0; i<OVMS_BT_LEVELS && boot_data.crash_data.bt[i].pc; i++)
      buf.printf("0x%08" PRIx32 " ", boot_data.crash_data.bt[i].pc);

    // Reset reason:
    buf.printf(",%d,%s", GetResetReason(), GetResetReasonName());

    // Event debug info:
    buf.printf(",%s,%s,%u", boot_data.curr_event_name, boot_data.curr_event_handler, boot_data.curr_event_runtime);

    // TWDT debug info:
    std::string tasknames = boot_data.wdt_tasknames;
    buf.append(",");
    buf.append(mp_encode(tasknames));

    // Hardware info:
    buf.append(",");
    buf.append(mp_encode(MetricsStandard::instance(TAG).ms_m_hardware->AsString("")));

    // Stack overflow task:
    std::string name = boot_data.stack_overflow_taskname;
    buf.append(",");
    buf.append(mp_encode(name));

    // Current tasks:
    for (int i = 0; i < 2; i++)
      {
      name = boot_data.curr_task[i].name;
      buf.append(",");
      buf.append(mp_encode(name));
      buf.printf(",%" PRIu32, boot_data.curr_task[i].stackfree);
      }

    // OvmsNotify::instance(TAG).NotifyString("data", "debug.crash", buf.c_str());
    }
  }
